Documents/упПересчетГрузовыхМест.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>упПересчетГрузовыхМест</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.упОстаткиГрузовыхМест</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСклады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧасовойПояс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упЧасовыеПояса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ГрузовыеМеста</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СкладскаяЯчейка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упСкладскиеЯчейки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГрузовоеМесто</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упГрузовыеМеста</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тара</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упГрузовыеМеста</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоГрузов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоФакт</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоГрузов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/упОстаткиГрузовыхМест.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>упОстаткиГрузовыхМест</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоГрузов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ГрузовоеМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упГрузовыеМеста</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тара</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упГрузовыеМеста</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СкладскаяЯчейка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСкладскиеЯчейки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/упПересчетГрузовыхМест/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	РеквизитыОбъекта = Новый Структура("Дата, Склад");
	ЗаполнитьЗначенияСвойств(РеквизитыОбъекта, ЭтотОбъект);

	ОстаткиГрузовыхМест = ГрузовыеМеста.ВыгрузитьКолонки("ГрузовоеМесто, Тара, СкладскаяЯчейка");
	ОстаткиГрузовыхМест.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число",
													   Новый КвалификаторыЧисла(10, 0, ДопустимыйЗнак.Любой)));
	
	
	Для каждого Строка Из ГрузовыеМеста Цикл
		
		Если НЕ Строка.Количество = 0 Тогда
			НоваяСтрока = ОстаткиГрузовыхМест.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			НоваяСтрока.Количество = -Строка.Количество;	
		КонецЕсли;
		
		Если НЕ Строка.КоличествоФакт = 0 Тогда
			НоваяСтрока = ОстаткиГрузовыхМест.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			НоваяСтрока.Количество = Строка.КоличествоФакт;	
		КонецЕсли;
		
	КонецЦикла;
	
	ДополнительныеСвойства.Вставить("ОстаткиГрузовыхМест", ОстаткиГрузовыхМест);
	
	// Формируются остатки грузовых мест на хабах, в случае мультимодальной перевозки.
	упКорректировкаМаршрута.СформироватьДвижениеОстаткиГрузовыхМест(ДополнительныеСвойства, Ссылка, Движения, РеквизитыОбъекта, Отказ);
	
	Движения.Записать();
	
	упКорректировкаМаршрута.ПроконтролироватьОтрицательныеОстаткиГрузовыхМестПоСкладу(ДополнительныеСвойства, Ссылка, Отказ);	

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

// Процедура - дозаполнить ТЧ "Грузовые места".
//
// Параметры:
//  Нет.
//
Процедура ЗаполнитьОстаткамиПоСкладу() Экспорт
	
	Запрос = Новый Запрос;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	упОстаткиГрузовыхМестОстатки.ГрузовоеМесто,
	|	упОстаткиГрузовыхМестОстатки.Тара,
	|	упОстаткиГрузовыхМестОстатки.СкладскаяЯчейка,
	|	упОстаткиГрузовыхМестОстатки.КоличествоОстаток КАК Количество
	|ИЗ
	|	РегистрНакопления.упОстаткиГрузовыхМест.Остатки(&Дата, СкладскаяЯчейка.Владелец = &Склад) КАК упОстаткиГрузовыхМестОстатки";
	Запрос.УстановитьПараметр("Дата", 	Дата);
	Запрос.УстановитьПараметр("Склад", 	Склад);
	
	ГрузовыеМеста.Очистить();
	ГрузовыеМеста.Загрузить(Запрос.Выполнить().Выгрузить());

КонецПроцедуры

#КонецОбласти

#КонецЕсли
